Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །བྱ་རྒྱལ་ངང་པ་བཞིན་དུ་དབྱངས་རབ་སྙན།
en: Your melodious voice resembles the songs of the swan—the king of birds—

source: །སྒྲ་སྙན་ཚད་མེད་རང་གི་ངང་གིས་འབྱུང་།
en: And countless delightful words manifest spontaneously from your mouth.

source: །ཅི་སླད་འོད་ཟེར་འདི་བཀྱེ་བཤད་དུ་གསོལ།
en: Please tell us why you emitted light! “The praises of your agreeable speech are proclaimed

source: །ཚིགས་བཅད་བྱེ་བ་ཚད་མ་མཆིས་པ་ཡིས། །རྗེས་འཐུན་གསུང་གི་བསྔགས་པ་བརྗོད་གྱུར་ཅིང་།
en: In countless millions of verses,

source: །ཀུ་ཙི་ར་ཡི་སྒྲ་སྐད་མཆོག་ལྡན་པ།
en: And you are endowed with the supreme voice of the black Indian cuckoo.

source: །ཅི་སླད་འོད་ཟེར་བཀྱེ་བ་བཤད་དུ་གསོལ།
en: Please tell us why you emitted light!

source: །འབྲུག་སྒྲ་ཟབ་མོས་ཆོས་ནི་བསྟན་པའི་སྒྲ།
en: “The deep thunder roar by which you teach the Dharma

source: །འཇིག་རྟེན་བརྒྱ་སྟོང་དཔག་མེད་གྲགས་གྱུར་པ།
en: Resounds throughout countless hundreds of thousands of worlds.

source: །ཐུགས་རྗེས་ཚིག་རྩུབ་ཡང་ན་འཇམ་སྟོན་པ།
en: Through your compassion you teach using both harsh and sweet words.

source: །ཅི་སླད་འོད་ཟེར་གསེར་གྱི་ཁ་དོག་བཀྱི།
en: Why did you emit golden light?

source: །སྐྱེ་དང་མི་སྐྱེ་ཟད་དང་མི་ཟད་མཁྱེན།
en: “You understand arising, non-arising, exhaustion, and non-exhaustion,

source: །མིག་ཉིད་བྲལ་ཞིང་འགྲོ་འོང་མེད་པར་རྟོགས།
en: And you realize that the eye is absent and beyond coming and going.

source: །འཇིག་རྟེན་སྣང་མཛད་བདུད་རྩིའི་མཆོག་གྱུར་པ།
en: Illuminator of the world, supreme ambrosia,

source: །ཅི་སླད་འོད་ཟེར་གསེར་གྱི་ཁ་དོག་བཀྱེ།
en: Why did you emit golden light?

source: །མིག་གི་བྱུང་བ་རྟག་ཏུ་སྟོང་དབེན་དང་། །འགྲོ་འོང་མ་མཆིས་གནས་པ་མ་མཆིས་དང་། །སྨིག་རྒྱུ་ཆུ་བུར་ལྟ་བུར་རབ་མཁྱེན་པ།
en: “You realize that the occurrence of the eye Is always empty and void, beyond coming and going, And groundless, like a mirage or a water bubble.

source: །རྒྱུ་རྐྱེན་གང་གི་སླད་དུ་འཛུམ་བསྟན་ལགས།
en: What are the causes and conditions of your smile? “Know that the same applies

source: །དེ་བཞིན་རྣ་བ་སྣ་ལྕེ་ལུས་དང་ཡིད།
en: To the ear, the nose, the tongue, the body, the mind,

source: །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ཆོས་རྣམས་ནས།
en: Forms, sounds, scents, tastes, textures, and mental phenomena,

source: །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར་དུ་ཡང་། །ཐམས་ཅད་དེ་བཞིན་དུ་ནི་རིག་པར་བགྱི།
en: Up to words, names, and so forth.

source: །རྡོ་རྗེ་རྟག་པའི་སྐུ་དང་མི་འཇིག་སྐུ།
en: “Your body is permanent like vajra and indestructible.

source: །མཚན་མཆོག་བརྒྱ་སྟོང་དག་ནི་ཕུན་སུམ་ཚོགས།
en: It is endowed with a hundred thousand perfect and supreme marks,

source: །སྐུ་ལ་འཁྲུལ་འཁོར་མི་མངའ་གཡོ་མཛད་པ།
en: And you move your body without any fetters.

source: །རྒྱུ་རྐྱེན་གང་སླད་འཛུམ་པ་བཤད་དུ་གསོལ།
en: Please tell us—what are the causes and conditions of your smile?

source: །བྱིན་པ་ཟླུམ་ཞིང་ཞབས་ཀྱི་རྟིང་པ་རིང་།
en: “Your calves are round, your heels are broad,

source: །ཕྱལ་གྱི་མཚན་མ་མི་གདའ་སེང་གེ་འདྲ།
en: And like a lion your abdomen does not bulge—

source: །ལྟེ་བ་ཤིན་ཏུ་ཟབ་ཅིང་རྐེད་རྒྱས་པ།
en: Your navel is deep, and your waist is broad.

source: །རྒྱུ་རྐྱེན་གང་སླད་འཛུམ་མཛད་བཤད་དུ་གསོལ།
en: Please tell us—what are the causes and conditions of your smile?

source: །གསེར་སྐུ་རྣམ་དག་རྡུལ་དང་དྲི་མ་སྤངས།
en: “Your golden body is pure, stainless, and immaculate,

source: །བ་སྤུ་རེ་རེ་ཁ་དོག་མཐོན་མཐིང་ལྡན།
en: And each hair on your body is deep black,

source: །གཡས་སུ་འཁྱིལ་ཅིང་སྤོས་ཀྱི་ངད་ལྡང་བ།
en: Perfumed, and curls to the right.

source: །སྐུ་མཆོག་དམ་པ་ཡོངས་རྫོགས་རྟག་གནས་པ།
en: “Your sublime body, perfect and permanently enduring,

source: །དཔེར་ན་ནྱ་གྲོ་དྷ་ཡི་ཤིང་རྒྱལ་བཞིན།
en: Is like the king of trees, the banyan fig.

source: །ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་ནི་རབ་ཏུ་བརྒྱན།
en: It is adorned with all qualities,

source: །གསུང་དབྱངས་དག་གིས་འཁོར་ནི་དགའ་བར་མཛད།
en: And your melodious voice pleases your retinues.

source: །དཔུང་པ་ཟླུམ་ཞིང་ཕྲག་པ་སྟུག་ལ་མཛེས།
en: “Your shoulders are round, your upper arms are thick and beautiful,

source: །གཙུག་ཏོར་ཡོངས་རྫོགས་གཡས་སུ་འཁྱིལ་བར་གདའ།
en: Your crown protuberance is perfect and coiled clockwise,

source: །ཞིང་ནི་བརྒྱ་སྟོང་དཔག་མེད་རྒྱུ་བར་མཛད།
en: You move throughout countless hundreds of thousands of realms,

source: །སེམས་ཅན་ལོག་དང་ཡང་དག་ལམ་སྟོན་མཛད།
en: And you point out to sentient beings the mistaken and the correct paths.

source: །ཚེམས་དཀར་དྲི་མི་མངའ་བས་དུང་དང་འདྲ།
en: “Your teeth are white and spotless like conch shells,

source: །ལྗགས་མཚན་སྲིད་རིང་ཞལ་ནི་ཀུན་དུ་ཁེབས།
en: Your tongue is long and can cover your whole face,

source: །འགྲམ་པ་སེང་གེ་འདྲ་ཞིང་ཤངས་ནི་མཐོ།
en: Your cheeks resemble the jaws of a lion, and your nose is prominent.

source: །ཐམས་ཅད་ཐབས་དང་རྣམ་དག་ཐུགས་ལས་སྐྱེས།
en: All those qualities arise from your skill and your pure mind.

source: །ཨུད་པ་ལ་ཡི་བསུང་ནི་ཞལ་ནས་འབྱུང་།
en: “The fragrance of blue lotus flowers exudes from your mouth,

source: །ཙན་དན་དྲི་དག་སྐུ་ནི་ཀུན་དུ་ཁྱབ།
en: And your body is pervaded by the scent of sandalwood.

source: །སྔོན་ནི་བྱམས་པ་རྒྱ་ཆེར་བསྒོམས་པས་ན།
en: Since you have cultivated love extensively in the past,

source: །རྣམ་དག་མོས་པ་རྟག་ཏུ་རྒྱུན་མི་འཆད།
en: Your pure intent is uninterrupted.

source: །དེ་བཞིན་གཤེགས་པའི་ཞབས་མཐིལ་ཤིན་ཏུ་མཉམ།
en: “Thus-Gone One, the soles of your feet are even,

source: །ས་ལ་རེག་ཀྱང་རྡུལ་ནི་གོས་མི་འགྱུར།
en: And although they touch the ground, they remain unsullied by dust.

source: །གོམ་པ་སེང་གེ་གླང་པོ་ཆེ་འདྲ་བས།
en: Walking like a lion and an elephant,

source: །འཇིག་རྟེན་ཐམས་ཅད་ལས་ནི་ཡང་དག་འདས།
en: You have transcended the entire world.

source: །འཁོར་ལོ་རྩིབས་སྟོང་མཚན་གྱིས་མཛེས་པར་བརྒྱན།
en: “You are beautified by the marks of thousand-spoked wheels,

source: །ཁྱད་འཕགས་འོད་ཟེར་དག་ནི་རབ་ཏུ་གསལ།
en: And your sublime light shines brilliantly.

source: །དགེ་བ་དག་གིས་སྐྱེ་དགུ་ཕན་འདོགས་པས།
en: Since you benefit beings through your virtue,

source: །གང་གིས་མཐོང་བ་དང་བ་རབ་ཏུ་སྐྱེ།
en: Whoever sees you is filled with faith.

source: །སོར་གཅིག་འོད་ཟེར་བརྒྱ་སྟོང་རབ་བཀྱེ་ནས།
en: “Each of your fingers emits a hundred thousand light rays

source: །སངས་རྒྱས་ཞིང་ནི་དཔག་མེད་སྣང་བར་མཛད།
en: That illuminate countless buddha realms.

source: །སྔོན་ནི་དགེ་སྦྱོང་མང་པོ་རབ་བསྒྲུབས་པས།
en: Since you have accomplished so many virtuous practices in the past,

source: །མཚན་གྱི་བཀོད་པ་སྣ་ཚོགས་འདི་བརྙེས་ལགས།
en: You have achieved those various arrays of excellent marks.

source: །གཟུགས་སྐུ་ཡོངས་རྫོགས་དཔེ་ཟླ་ཡོང་མ་མཆིས།
en: “Your form body is perfect and unequaled,

source: །ཞལ་མཚན་རབ་མཛེས་ཤིན་ཏུ་ཁྱད་པར་འཕགས།
en: The marks that beautify your face are magnificent,

source: །རྫུ་འཕྲུལ་དག་གིས་འཇིག་རྟེན་ཕན་འདོགས་པ།
en: And you benefit the world through your miraculous powers.

source: །བྱིན་པ་རི་དགས་ཨེ་ན་ཡ་དང་འདྲ།
en: “Your calves are similar to the calves of antelope,

source: །སྐུ་དབྱིབས་མི་རྒུ་སེང་གེ་ཇི་ལྟ་བཞིན།
en: And the shape of your body resembles that of a lion.

source: །འཇིག་རྟེན་བྱུང་ནས་འཇིག་རྟེན་སྣང་མཛད་པ།
en: You appear within the worlds and illuminate them.

source: །ཅང་ཤེས་བཞིན་དུ་མཚན་སྦས་རྡུལ་མི་མངའ།
en: “Like a stallion, your genitals are hidden and stainless;

source: །ཕྱག་མཐིལ་མཉམ་རྒྱས་ཕྱག་ནི་པུས་མོ་འདས།
en: The palms of your hands are even and broad, And your arms reach past your knees.

source: །མི་ཡི་སེང་གེ་ངོ་མཚར་ཁྱད་པར་འཕགས། །ཅི་སླད་འཛུམ་པ་བསྟན་མཛད་བཤད་དུ་གསོལ།
en: Amazing and magnificent lion of human beings, please tell us why you smile!

source: །སྐུ་ལས་འོད་ཟེར་དཔག་མེད་རབ་འགྱེད་ཅིང་། ཁ་དོག་གྱ་ནོམ་རབ་ཞི་རྟག་གསལ་བ།
en: “Innumerable brilliant, soothing, and brightly colored light rays Radiate from your body.

source: །རྣམ་དག་ཐུགས་ནི་རྟག་ཏུ་རྒྱུན་མི་འཆད།
en: Your pure mind is uninterrupted,

source: །མདོ་སྡེ་ཚད་མེད་པ་དག་སྟོན་པར་མཛད།
en: And you reveal countless discourses. “Such qualities will not be accomplished

source: །རྟག་དང་ཆད་པ་དག་ལ་གནས་པ་ཡིས། །དེ་འདྲའི་ཆོས་ནི་བསྒྲུབ་པར་འགྱུར་མ་ལགས།
en: By those who uphold eternalist or nihilist views.

source: །གང་གིས་མཐར་ལྟ་རྣམས་ནི་རབ་སྤངས་ན།
en: Only those who have abandoned extreme views

source: །བཅོམ་ལྡན་རྣམ་དག་སྐུ་ནི་མྱུར་ཐོབ་འགྱུར།
en: Will swiftly attain the pure body of the blessed ones.

source: །ལྷ་རྔ་འབྲུག་སྒྲ་གསུང་ནི་ཀུན་གྲགས་ཤིང་།
en: “Your speech resounds like divine drums and roaring thunder;

source: །ཀ་ལན་དཀའི་དབྱངས་སྙན་རབ་ཏུ་གསལ།
en: It is melodious and clear like the songs of the kalandaka bird

source: །ལྷ་ཡི་གླུ་སྒྲ་བརྒྱ་སྟོང་མང་ལྡན་པ།
en: And endowed with a hundred thousand tunes of divine songs.

source: །འདྲེན་པས་གསུང་གཅིག་ཏུ་ནི་ཆོས་བསྟན་པས།
en: “Great Guide, by teaching the Dharma through a single teaching,

source: །འཆལ་པའི་ཚུལ་ཁྲིམས་ཅན་དག་རྒྱུན་ཡང་བཅད།
en: You interrupt the practices of those who adhere to improper discipline.

source: །དེ་བཞིན་གཤེགས་པས་དབྱངས་རབ་གང་གསུངས་པ།
en: Whatever melodious words come from the Thus-Gone One’s mouth

source: །དེ་ཀུན་ཟབ་ཅིང་ངོ་མཚར་ཆོས་ལགས་སོ།
en: Are profound and amazing!

source: །ཁྱུ་མཆོག་སྨིན་མཚམས་འོད་ཟེར་རབ་བཀྱེ་བས།
en: “Leader of human beings, the light rays emitted from between your eyebrows

source: །སངས་རྒྱས་ཞིང་ནི་བརྒྱ་སྟོང་གསལ་བར་མཛད།
en: Illuminate a hundred thousand buddha realms,

source: །སྤྱན་མཆོག་དག་ནི་ཁ་དོག་མཐོན་མཐིང་འདྲ།
en: Your sublime eyes have a deep black color,

source: །གཙུག་ཏོར་མཚན་ནི་མཁའ་ཡི་ལྷས་མི་མཐོང་།
en: And the mark of your crown protuberance cannot be seen by the celestial gods.

source: །ཚེམས་དཀར་གཏམས་པ་བཞི་བཅུ་དག་དང་ལྡན།
en: “Your forty teeth,

source: །དཔེར་ན་རིན་ཆེན་ཆུ་ཤེལ་དག་དང་མཚུངས།
en: White like crystal,

source: །དགེ་བའི་ཕྲིན་ལས་ཚད་མེད་དག་ལས་སྐྱེས།
en: Are the manifestation of your immeasurable virtuous activities.

source: །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་རྫོགས་པའི་སྐུ།
en: “Thus-Gone One, your body of perfect qualities

source: །ཁ་དོག་དམ་པ་དཔག་མེད་ཕུན་ཚོགས་ཤིང་།
en: Shines with countless excellent and magnificent colors

source: །འོད་ཟེར་རྣམ་དག་ངོ་མཚར་རབ་བཀྱེ་བ།
en: And emits the most amazing pure light rays.

source: །ཐུགས་རྗེ་ཆེན་པོ་མཆོག་རྒྱལ་རྐང་གཉིས་གཙོ།
en: “Great compassionate one, supreme victor, leader of human beings,

source: །སེམས་ཅན་ཡང་དག་བསམ་པ་ཐུགས་སུ་ཆུད།
en: You know the pure intentions of sentient beings,

source: །ཐོགས་པ་མ་མཆིས་སྤོབས་པ་མཆོག་བརྙེས་པ།
en: And you have achieved supreme, unimpeded eloquence.

source: །དེ་བཞིན་གཤེགས་པས་ཕ་རོལ་རབ་བྱོན་པས།
en: “Since the Thus-Gone One has reached the other shore,

source: །རིག་པ་གསུམ་དང་མངོན་ཤེས་དྲུག་ཕུན་ཚོགས།
en: He is perfectly endowed with the three knowledges and the six higher perceptions,

source: །རྣམ་དག་འོད་ཟེར་དཔག་མེད་སྟོན་མཛད་པ།
en: And he displays innumerable pure light rays.

source: །བཅོམ་ལྡན་སྔོན་ནི་བསྐལ་པ་དཔག་མེད་སྙེད།
en: “Blessed One, during countless eons in the past,

source: །བཅོམ་ལྡན་བརྒྱ་སྟོང་སྙེད་ལ་མཆོད་པ་མཛད།
en: You worshiped a hundred thousand blessed ones,

source: །དེ་འདྲའི་རྒྱུ་འབྲས་ཆབ་ནི་མི་འཚལ་བ།
en: And the fruition of such causes is inexhaustible.

source: །ཏིང་འཛིན་མཆོག་རྣམས་ལ་ནི་རབ་བཞུགས་པས།
en: You have dwelled within supreme states of absorption,

source: །མིག་གི་སྐྱེ་མཐའ་ཟད་པའི་མཐའ་མཁྱེན་ན།
en: You have realized the limits of the arising and exhaustion of the eye.

source: །འདས་པ་དང་ནི་མ་འོངས་ད་ལྟར་དུས། །འདྲེན་པས་དེ་དག་ཀུན་ནི་རབ་ཏུ་མཁྱེན།
en: The past, the future, and the present—

source: །རྣམ་དག་མཁྱེན་པ་ཐོགས་མེད་བསམ་མི་ཁྱབ།
en: Your immaculate wisdom is unimpeded and inconceivable,

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་མང་པོའི་མདུན་དུ་ཕྱག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་བརྐྱང་སྟེ། ཟླ་འོད་གཞོན་ནུར་གྱུར་པའི་སྤྱི་བོ་ལ་བཞག་ནས་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: At that moment, in front of the numerous retinues, the Blessed One extended his golden hand, placed it on Candraprabhakumārabhūta’s head, and spoke these verses:

source: །གཞོན་ནུ་ཤིན་ཏུ་ལེགས་པར་ཉོན།
en: “Kumāra, listen carefully!

source: །ངས་ནི་དེང་འདིར་བྱང་ཆུབ་ཆོས།
en: I now entrust to you This teaching on awakening—

source: །འོད་ཟེར་རབ་ཏུ་སྟོན་པའི་མདོ། །ཁྱོད་ལ་ཤིན་ཏུ་ཡོངས་གཏད་ཀྱིས།
en: The sūtra on the manifestation of lights.

source: །མ་འོངས་ཐ་མ་དུས་ངན་ཚེ།
en: “In the future, during the final period Of the degenerate times,

source: །ཆོས་ནི་རྣམ་པར་འཇིག་པ་ན།
en: When the Dharma is about to vanish,

source: །ཁྱོད་ཀྱིས་སེམས་ཅན་རྣམས་ལ་ནི། །རབ་ཏུ་ཕྱེ་ནས་བཤད་པར་གྱིས།
en: You must reveal it and expound it to sentient beings!

source: །ངས་ནི་སངས་རྒྱས་སྤྱན་དག་གིས།
en: “With my buddha eye, I see and know

source: །ཤིན་ཏུ་ཟབ་ཅིང་གྱ་ནོམ་པའི། །མདོ་སྡེ་དམ་པ་འདི་དག་ལ།
en: Will be interested in this excellent, profound, and sacred sūtra,

source: །གང་མོས་གང་ནི་མི་མོས་པ། །ཐམས་ཅད་ཀུན་ཀྱང་གཟིགས་ཤིང་མཁྱེན།
en: As well as all those who will not be interested in it.

source: །བྱང་ཆུབ་ལམ་ནི་རབ་ཚོལ་བ།
en: The path of awakening

source: །རྟག་ཏུ་སངས་རྒྱས་རྗེས་དྲན་ཞིང་།
en: Should constantly recollect the Buddha

source: །མདོ་སྡེ་འདི་ནི་གཟུང་བར་གྱིས།
en: And keep this discourse in mind.

source: །གང་ཞིག་དད་པ་རབ་འཇིག་ཅིང་།
en: “Those whose faith has disappeared,

source: །འདུ་འཛི་ལ་ནི་མོས་འགྱུར་དང་། །ཉིན་མཚན་གཉིད་ལ་གང་དགའ་བ།
en: Who are attracted to distraction, And who delight in sleeping both day and night

source: །མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར།
en: Will not be interested in this discourse. “Even if they become renunciants

source: །ང་ཡི་བསྟན་པ་དག་ལས་ནི། །རབ་ཏུ་བྱུང་བར་གྱུར་ནས་ཀྱང་།
en: Under my teachings,

source: །མྱ་ངན་འདས་པའི་ཆོས་དག་ལ།
en: Interest in the qualities of nirvāṇa

source: །མོས་པ་དག་ནི་མི་སྐྱེ་བ།
en: Will not arise in them.

source: །སྐྱེས་བུ་བླུན་པོ་དེ་དག་ནི། །དད་པས་བྱིན་པ་ཆུད་གཟོན་འགྱུར། །འདུས་བྱས་རྣམས་ཀྱི་ཆོས་དག་ལ།
en: “Those fools will squander the gifts of faith,

source: །ཉེས་དམིགས་མང་བར་ཐོས་ཀྱང་ནི།
en: And even if they hear repeatedly About the defects associated with conditioned phenomena,

source: །འཇིག་རྟེན་དག་ལ་མངོན་ཞེན་ནས། །འཇིགས་པ་དག་ནི་མི་སྐྱེ་བ།
en: They will cling to worldly concerns, and fear will not arise in them.

source: །སྐྱེས་བུ་བླུན་པོ་དེ་དག་ནི།
en: “Those fools

source: །མཁས་པ་རྣམས་ཀྱིས་སྨོད་པར་འགྱུར།
en: Will deprecate the wise ones,

source: །ཆོས་གོས་དག་ནི་བགོས་གྱུར་ཀྱང་།
en: And even if they wear the Dharma robes,

source: །དེ་ལ་ཤེས་རབ་ཅི་ཡང་མེད།
en: They will be devoid of even the slightest trace of insight. “Since they will not know the true words

source: །ཐུབ་པས་ལེགས་པར་གསུངས་པ་ཡི། །ཡང་དག་བཀའ་ནི་གང་ཡིན་པ།
en: Well-spoken by the Sage,

source: །ཤེས་པ་མེད་པས་ཐོས་གྱུར་ན། །ཡིད་ཆེས་ལེན་པར་མི་འགྱུར་ཏེ།
en: And even if they hear them, they will not believe in them,

source: །སྐྱེས་བུ་བླུན་པོ་དེ་དག་དང་། །ལྷན་ཅིག་གནས་པར་མི་བྱའོ།
en: Do not stay in the company of such fools!

source: །ཁྱད་པར་འཕགས་པའི་ཆོས་འདི་དག །གལ་ཏེ་ཐོས་པར་གྱུར་ནས་ཀྱང་།
en: “Even if they hear these magnificent teachings,

source: །རབ་ཏུ་དགའ་ཞིང་མོས་པ་ཡི། །སེམས་ཀྱང་སྐྱེ་བར་མི་འགྱུར་བ།
en: Joy and devotion will not arise in their minds.

source: །དེ་འདྲའི་གང་ཟག་དག་ལ་ནི། །ངས་ནི་རབ་ཏུ་སྨོད་པར་བྱེད།
en: I reproach such individuals;

source: །མི་ལུས་ཐོབ་པར་གྱུར་མོད་ཀྱང་། །དེ་ནི་དོན་མེད་ཆུད་ཟོས་ཡིན།
en: Though they have a human body, they waste it in meaningless pursuits. “Those whose minds become filled with joy and devotion

source: །གལ་ཏེ་ཤིན་ཏུ་ཟབ་པའི་ཆོས། །འདི་དག་ཐོས་པར་གྱུར་ནས་ནི། །རབ་ཏུ་དགའ་ཞིང་མོས་པ་ཡི། །སེམས་ནི་རབ་ཏུ་སྐྱེ་འགྱུར་བ། །དེ་འདྲའི་གང་ཟག་དེ་དག་ནི།
en: When they hear these profound teachings

source: །སྔོན་ཆད་སངས་རྒྱས་ཕྲད་པས་ན། །གདོན་མི་ཟ་བ་ཁོ་ནར་ནི།
en: Have already met buddhas in the past.

source: །བླ་མེད་བྱང་ཆུབ་ཐོབ་པར་འགྱུར།
en: There is thus no doubt that they will reach unsurpassed awakening.

source: །སྐྱེས་བུ་བླུན་པོ་གང་དག་ཅིག །ལྟ་བ་ངན་པས་རབ་སྨས་ནས།
en: “Fools who are inferior due to their unwholesome views

source: །ཤེས་རབ་སྲོག་ནི་གཅོད་བྱེད་པ། །བྱང་ཆུབ་ཡོངས་སུ་སྤོང་བར་འགྱུར།
en: And sever the life force of insight will forsake awakening;

source: །དེ་ལྟ་བས་ན་མི་དགེ་བའི། །བཤེས་གཉེན་དག་ནི་རབ་སྤངས་ནས།
en: Therefore, abandon such nonvirtuous friends

source: །བློ་ལྡན་མཁས་པ་དག་ལ་ནི། །བསྟེན་ཅིང་གུས་པ་བསྐྱེད་པར་བྱ།
en: And instead attend to the wise ones and revere them!

source: །འཇིག་རྟེན་དག་ནི་ཐམས་ཅད་ན།
en: “All the innumerable defects in all the worlds,

source: །ཉེས་དམིགས་ཚད་མེད་གང་ཡོད་དང་། །སེམས་ཅན་ངན་སོང་གསུམ་པོར་ནི། །རྟག་ཏུ་བྱིང་བར་གང་བྱེད་པ།
en: And all sentient beings sinking in the three lower realms,

source: །ཐམས་ཅད་གཏི་མུག་རྨོངས་པ་ཡི། །རྒྱུ་དང་རྐྱེན་ལས་བྱུང་བས་ན།
en: Originate from the causes and conditions of ignorance and delusion;

source: །ཉོན་མོངས་རྗེས་སུ་འཇུག་བྱེད་ཅིང་། །རང་དབང་དག་ནི་འཐོབ་མི་འགྱུར།
en: Therefore, those who follow their afflictions will not gain freedom.

source: །ཡང་དག་ཆོས་ནི་སྤོང་བྱེད་ཅིང་།
en: “Since they forsake the true Dharma

source: །ཆོས་མ་ཡིན་པ་སྤྱོད་པར་བྱེད།
en: And practice what is contrary to the Dharma,

source: །དེ་ལྟ་བས་ན་རྨོངས་པ་ཡི།
en: You should abandon

source: །སྐྱེས་བུ་དམན་པ་སྤང་བར་བྱ།
en: Those inferior, deluded beings!

source: །ཇི་ལྟར་ཁ་ལོ་སྒྱུར་བ་ཡིས།
en: “Like a charioteer breaking

source: །རང་གི་སྲོག་ཤིང་བཅག་པ་བཞིན།
en: The axle of his steering wheels,

source: །མི་དགེ་ལས་ནི་བྱས་པས་ན། །སེམས་ཅན་དམྱལ་བར་སྐྱེ་བར་འགྱུར།
en: Sentient beings who engage in nonvirtuous actions Will be reborn in the hell realms.

source: །ཁ་ནས་ཚིག་ངན་ཕྱུང་ནས་ནི། །རྟག་ཏུ་བདག་ལ་གནོད་བྱེད་པ།
en: “Abusive words always come back to harm Those who pronounce them,

source: །ཇི་ལྟར་སྟ་རེ་རྣོ་ཐོགས་ནས། །རང་གི་ལུས་ནི་གཅོད་བྱེད་འདྲ།
en: Just like a sharp axe that strikes the body Of the one who wields it. “Karmic ripening is experienced without fail,

source: །ཆོས་རྣམས་རྒྱུ་དང་རྐྱེན་དག་གིས། །བྱས་པའི་ལས་ཀྱི་རྗེས་སུ་ནི། །རྣམ་སྨིན་མྱོང་བ་སྐྱབས་མེད་པར།
en: In accordance with the causes and conditions of the actions performed.

source: །དེ་ལྟར་ཁོང་དུ་མ་ཆུད་པས། །འཇིག་རྟེན་དྲང་སྲོང་ལ་བསྟེན་ནས།
en: Those who do not understand this will attend to worldly sages,

source: །དགེ་བའི་གྲོགས་པོ་ཡིན་སྙམ་སེམས།
en: Thinking they are virtuous friends.

source: །དེ་ནས་རང་ཉིད་འདི་སྙམ་དུ། །སྟོང་པ་ཉིད་ནི་གང་བསྒོམ་པ།
en: “Then, thinking that those who meditate on emptiness

source: །འདུས་མ་བྱས་ནི་རྟོགས་སྙམ་ནས། །ཆད་པར་ལྟ་བ་སྐྱེད་པར་བྱེད།
en: Realize the unconditioned, they will develop nihilist views;

source: །ལུས་ནི་སྣོད་ཆག་པ་དང་འདྲ།
en: They will say that the body becomes like a broken pot

source: །སེམས་ཀྱང་རྗེས་སུ་འགག་གྱུར་ཞེས།
en: And that the mind also ceases to be.

source: །ཕལ་ཆེར་ཀྱལ་བའི་ཚིག་དག་ལ།
en: “They will mostly be drawn

source: །མོས་པ་ཉིད་དུ་རབ་འགྱུར་ཞིང་།
en: To idle gossip,

source: །འདི་ལ་མངོན་པར་ཞེན་པས་ན།
en: And, strongly attached to it,

source: །ཕན་པའི་དོན་ནི་ཅི་ཡང་མེད།
en: They will gain no benefits whatsoever.

source: །གལ་ཏེ་སྦྲུལ་ནི་གདུག་པ་ཡིས། །གནོད་པ་དག་ནི་རབ་བྱས་ཀྱང་།
en: “The harm caused by poisonous snakes

source: །ནམ་ཡང་སྐྱེ་དགུ་མང་པོ་རྣམས། །ངན་འགྲོ་དག་ཏུ་ལྟུང་མི་བྱེད།
en: Will never cause many beings to fall into the lower realms,

source: །བླུན་པོ་གང་ཞིག་ཆོས་སྟོན་པ། །དགེ་བའི་རྩ་བ་འཇིག་བྱེད་པས།
en: But when a fool teaches the Dharma he destroys roots of virtue,

source: །སྐྱེ་དགུ་མང་པོ་ཚད་མེད་སྙེད། །སེམས་ཅན་དམྱལ་བར་ལྟུང་བར་བྱེད།
en: Which causes countless beings to fall into the hell realms.

source: །ཁྱེད་ལ་སོགས་པ་འཁོར་འདུས་པ། །འདི་ལྟ་བུར་ནི་ལྟ་བར་གྱིས།
en: “You who have gathered in this assembly should consider

source: །དེང་འདིར་ང་ཡི་སྤྱན་སྔར་ནི། །ཟླ་འོད་གཞོན་ནུ་གང་འདུག་པ།
en: That Candraprabhakumāra, who is present here today,

source: །འདིས་ནི་སྔོན་ཆད་འདས་པ་ཡི། །སངས་རྒྱས་དག་ནི་བཅོམ་ལྡན་འདས།
en: Has worshiped and venerated countless blessed buddhas in the past—

source: །ཚད་མེད་གང་གཱའི་ཀླུང་བྱེ་སྙེད།
en: As many as there are grains of sand in the Ganges.

source: །མཆོད་པ་རིམ་གྲོ་རབ་བྱས་ཤིང་།
en: “Since he has pursued unsurpassed wisdom

source: །ཤིན་ཏུ་བརྟན་པར་ཡོངས་བསྒོམས་ནས། །བླ་མེད་ཡེ་ཤེས་བཙལ་བས་ན། །སྲིད་པ་དག་ནི་ཐམས་ཅད་ལ།
en: By meditating in a steadfast manner,

source: །སེམས་ཀྱིས་གནས་པ་ཅི་ཡང་མེད།
en: His mind does not dwell On any of the realms of existence.

source: །མིག་གི་སྐྱེ་མཐའ་གཏན་དུ་ནི།
en: “Since he knows that the limit of the arising of the eye

source: །རྣམ་པར་དག་པར་ཤེས་པས་ན།
en: Is always pure,

source: །སྤྲོས་པ་དག་ནི་ཡོངས་སྤངས་ནས།
en: He has abandoned concepts,

source: །མངོན་པར་ཞེན་པ་ཅི་ཡང་མེད།
en: And he is utterly free from clinging.

source: །སེམས་ཅན་དག་ནི་ཚད་མེད་ལ།
en: “He will teach this unsurpassed sūtra On the manifestation of lights

source: །ཕན་པ་དག་ནི་བྱ་བའི་ཕྱིར། །བླ་མེད་འོད་ཟེར་སྟོན་པ་ཡི། །མདོ་སྡེ་དག་ནི་སྟོན་པར་བྱེད།
en: In order to benefit

source: །སྐྱེས་བུ་བླུན་པོ་གང་ཡིན་པ།
en: Countless sentient beings.

source: །ཆོས་འདི་སློབ་པར་མི་ནུས་པས། །རྣལ་འབྱོར་བསྒོམ་པ་དག་ལ་ནི།
en: “Since fools are unable to train in this teaching,

source: །སྐྱོན་ཉིད་དུ་ཡང་ལྟ་བར་བྱེད།
en: They regard genuine spiritual practices as faulty.

source: །དེ་ལྟ་བས་ན་བླུན་པོ་དག །ཐག་རིང་པོར་ནི་ཡོངས་སྤངས་ནས།
en: Therefore, stay far away from such fools;

source: །དེ་དག་ལ་ནི་བསྟན་མི་བྱ། །དེ་ཡི་ཆོས་ཀྱང་མི་བསླབ་བོ། །སྐྱེས་བུ་བླུན་པོ་གང་ཡིན་པ།
en: Do not assist them, and do not train in their teachings!

source: །རྩོད་པའི་སྨྲ་ལ་མོས་པས་ན།
en: “Since fools are attracted to dispute,

source: །རྩོད་སྨྲ་མེད་པའི་སྤྱོད་པ་ལ། །ནན་ཏན་བསྒྲུབ་པར་མི་ནུས་པས།
en: They are unable to earnestly adopt behavior that is free from conflict.

source: །སྐྱེས་བུ་དེ་དག་རྣམས་ལ་ནི། །ཚུལ་བཞིན་སེམས་ནི་ཅི་ཡང་མེད།
en: Such beings are utterly devoid of an appropriate mindset,

source: །དེ་ལྟ་བས་ན་དེ་དག་ལ། །བསྙེན་བཀུར་མི་བྱ་བསྔགས་མི་བརྗོད།
en: So do not serve them or proclaim their praise!

source: །སྐྱེས་བུ་བླུན་པོ་གང་ཡིན་པ། །ལེ་ལོ་སྙོམ་ལས་ལ་གནས་པས།
en: “Since fools are lazy and indolent by nature,

source: །རྟག་ཏུ་ལུས་དང་ངག་ཡིད་ཀྱི།
en: They constantly engage in physical, verbal, and mental nonvirtuous actions;

source: །མི་དགེ་ལས་ནི་སྤྱོད་པས་ན།
en: They therefore completely lack

source: །དེ་ལ་ཚུལ་ཁྲིམས་དག་པ་དང་། །ཤེས་རབ་མང་ཐོས་ཅི་ཡང་མེད།
en: Pure discipline, insight, and erudition.

source: །རྟག་ཏུ་འདོད་པའི་ཡུལ་སེམས་ཤིང་།
en: “They always think about the objects of their desires,

source: །འདུ་འཛི་དག་ལ་མོས་པར་བྱེད། །ཁྱེད་ཀྱིས་འདི་ལྟར་བླུན་པོ་དེ།
en: And they are drawn to distractions;

source: །རིགས་དང་རུས་དང་ལུས་ཀྱང་ནི།
en: Regard the families, blood lines,

source: །དམན་པ་ཡིན་པར་རབ་ཏུ་ལྟོས།
en: And bodies of such fools as inferior!

source: །ཁོང་ཁྲོ་བཀའ་བློ་མི་བདེ་ཞིང་།
en: “They are filled with aggression, they do not listen to advice,

source: །བྱད་བཞིན་དག་ནི་མི་སྡུག་ལ།
en: And their faces are repulsive;

source: །གལ་ཏེ་དགེ་བའི་གནས་སྐྱེས་ཀྱང་།
en: Even if they are born in virtuous locations,

source: །ལུས་ནི་རྟག་ཏུ་མ་རབས་འགྱུར།
en: Their bodies will be vile.

source: །བདག་ཏུ་འདུ་ཤེས་ལ་ཞེན་པས། །ཡང་དག་དོན་ལ་རྨོངས་པར་འགྱུར།
en: “Since they cling to the notion of self, they are deluded about the true meaning.

source: །བློ་གྲོས་དག་དང་མི་ལྡན་པས། །ཚིག་གི་བྱེ་བྲག་འབྱེད་མི་ནུས།
en: Since they lack intelligence, they are unable to understand the diversity of words.

source: །རང་བཞིན་སྟོང་པའི་ཆོས་ཐོས་ཀྱང་།
en: Even if they hear teachings about intrinsic emptiness,

source: །དེ་ལ་མོས་པ་སྐྱེད་མི་འགྱུར།
en: They are not interested in them.

source: །དེ་བཞིན་གཤེགས་པ་བཅོམ་ལྡན་འདས།
en: “The thus-gone ones, the blessed ones

source: །ཡུན་རིང་པོ་ནས་འཇིག་རྟེན་པའི། །ཚིག་གི་སྤྲོས་པ་གང་ཡིན་པ། །ཐམས་ཅད་རབ་ཏུ་སྤངས་པ་ཡིན།
en: Have long ago abandoned all worldly verbal constructs.

source: །སོ་སོའི་སྐྱེ་བོས་འདི་དག་ལ། །ཤིན་ཏུ་ཞེན་ཅིང་ཆགས་པས་ན།
en: Ordinary beings cling and are attached to those,

source: །ཇི་སྲིད་འཚོ་བའི་བར་དུ་ཡང་། །རྟོགས་ཤིང་ཁོང་དུ་ཆུད་མི་འགྱུར།
en: And so, for as long as they live, they fail to gain understanding and realization.

source: །ཚུལ་ཁྲིམས་བསྔགས་པ་རྗོད་བྱེད་ཀྱང་།
en: “Though they might proclaim the praises of discipline,

source: །ཚངས་པར་སྤྱོད་པ་སྒྲུབ་མི་བྱེད།
en: They do not practice pure conduct.

source: །ཁ་ནས་ཆོས་ནི་སྟོན་བྱེད་ཀྱང་།
en: Though their mouths might teach the Dharma,

source: །ལུས་ཀྱིས་ཆོས་མིན་སྤྱོད་པར་བྱེད།
en: Their bodies engage in practices that are contrary to it.

source: །རང་གིས་འདུལ་བ་སྟོན་བྱེད་ཀྱང་།
en: “Though they might teach the Vinaya,

source: །རྟག་ཏུ་འདུལ་མིན་སྤྱོད་པར་བྱེད།
en: They always behave in ways that are contrary to it.

source: །སངས་རྒྱས་སློབ་མ་དག་ལ་ནི།
en: The Buddha has instructed his disciples

source: །ཁ་དོག་བསྒྱུར་བའི་གོས་གྱོན་གསུངས།
en: To wear the saffron-colored robes.
